## 🚨 Terraform Plan (PRD) - PRODUCTION

### Summary
Summary not available

> ⚠️ **This plan affects PRODUCTION infrastructure!**

<details>
<summary>Show Plan Details</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # module.acm[0].aws_acm_certificate.main will be created
  + resource "aws_acm_certificate" "main" {
      + arn                       = (known after apply)
      + domain_name               = "boneofmyfallacy.net"
      + domain_validation_options = [
          + {
              + domain_name           = "*.boneofmyfallacy.net"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "boneofmyfallacy.net"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + region                    = "us-east-1"
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "*.boneofmyfallacy.net",
          + "boneofmyfallacy.net",
        ]
      + tags                      = {
          + "Environment" = "prd"
          + "Name"        = "serverless-blog-cert-prd"
          + "Project"     = "serverless-blog"
        }
      + tags_all                  = {
          + "Environment" = "prd"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "serverless-blog-cert-prd"
          + "Project"     = "serverless-blog"
        }
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"

      + options (known after apply)
    }

  # module.api.aws_api_gateway_account.main[0] will be created
  + resource "aws_api_gateway_account" "main" {
      + api_key_version     = (known after apply)
      + cloudwatch_role_arn = (known after apply)
      + features            = (known after apply)
      + id                  = (known after apply)
      + region              = "ap-northeast-1"
      + throttle_settings   = (known after apply)
    }

  # module.api.aws_api_gateway_authorizer.cognito will be created
  + resource "aws_api_gateway_authorizer" "cognito" {
      + arn                              = (known after apply)
      + authorizer_result_ttl_in_seconds = 300
      + id                               = (known after apply)
      + identity_source                  = "method.request.header.Authorization"
      + name                             = "blog-cognito-authorizer"
      + provider_arns                    = (known after apply)
      + region                           = "ap-northeast-1"
      + rest_api_id                      = (known after apply)
      + type                             = "COGNITO_USER_POOLS"
    }

  # module.api.aws_api_gateway_gateway_response.default_4xx will be created
  + resource "aws_api_gateway_gateway_response" "default_4xx" {
      + id                  = (known after apply)
      + region              = "ap-northeast-1"
      + response_parameters = {
          + "gatewayresponse.header.Access-Control-Allow-Headers" = "'Content-Type,Authorization,X-Amz-Date,X-Api-Key,X-Amz-Security-Token'"
          + "gatewayresponse.header.Access-Control-Allow-Methods" = "'GET,POST,PUT,DELETE,OPTIONS'"
          + "gatewayresponse.header.Access-Control-Allow-Origin"  = "'https://boneofmyfallacy.net'"
        }
      + response_templates  = {
          + "application/json" = "{\"message\":$context.error.messageString}"
        }
      + response_type       = "DEFAULT_4XX"
      + rest_api_id         = (known after apply)
    }

  # module.api.aws_api_gateway_gateway_response.default_5xx will be created
  + resource "aws_api_gateway_gateway_response" "default_5xx" {
      + id                  = (known after apply)
      + region              = "ap-northeast-1"
      + response_parameters = {
          + "gatewayresponse.header.Access-Control-Allow-Headers" = "'Content-Type,Authorization,X-Amz-Date,X-Api-Key,X-Amz-Security-Token'"
          + "gatewayresponse.header.Access-Control-Allow-Methods" = "'GET,POST,PUT,DELETE,OPTIONS'"
          + "gatewayresponse.header.Access-Control-Allow-Origin"  = "'https://boneofmyfallacy.net'"
        }
      + response_templates  = {
          + "application/json" = "{\"message\":$context.error.messageString}"
        }
      + response_type       = "DEFAULT_5XX"
      + rest_api_id         = (known after apply)
    }

  # module.api.aws_api_gateway_integration.admin_auth_login_options will be created
  + resource "aws_api_gateway_integration" "admin_auth_login_options" {
      + cache_namespace        = (known after apply)
      + connection_type        = "INTERNET"
      + http_method            = "OPTIONS"
      + id                     = (known after apply)
      + passthrough_behavior   = (known after apply)
      + region                 = "ap-northeast-1"
      + request_templates      = {
          + "application/json" = jsonencode(
                {
                  + statusCode = 200
                }
            )
        }
      + resource_id            = (known after apply)
      + response_transfer_mode = (known after apply)
      + rest_api_id            = (known after apply)
      + timeout_milliseconds   = 29000
      + type                   = "MOCK"
    }

  # module.api.aws_api_gateway_integration.admin_auth_logout_options will be created
  + resource "aws_api_gateway_integration" "admin_auth_logout_options" {
      + cache_namespace        = (known after apply)
      + connection_type        = "INTERNET"
      + http_method            = "OPTIONS"
      + id                     = (known after apply)
      + passthrough_behavior   = (known after apply)
      + region                 = "ap-northeast-1"
      + request_templates      = {
          + "application/json" = jsonencode(
                {
                  + statusCode = 200
                }
            )
        }
      + resource_id            = (known after apply)
      + response_transfer_mode = (known after apply)
      + rest_api_id            = (known after apply)
      + timeout_milliseconds   = 29000
      + type                   = "MOCK"
    }

  # module.api.aws_api_gateway_integration.admin_auth_refresh_options will be created
  + resource "aws_api_gateway_integration" "admin_auth_refresh_options" {
      + cache_namespace        = (known after apply)
      + connection_type        = "INTERNET"
      + http_method            = "OPTIONS"
      + id                     = (known after apply)
      + passthrough_behavior   = (known after apply)
      + region                 = "ap-northeast-1"
      + request_templates      = {
          + "application/json" = jsonencode(
                {
                  + statusCode = 200
                }
            )
        }
      + resource_id            = (known after apply)
      + response_transfer_mode = (known after apply)
      + rest_api_id            = (known after apply)
      + timeout_milliseconds   = 29000
      + type                   = "MOCK"
    }

  # module.api.aws_api_gateway_integration.admin_categories_id_options will be created
  + resource "aws_api_gateway_integration" "admin_categories_id_options" {
      + cache_namespace        = (known after apply)
      + connection_type        = "INTERNET"
      + http_method            = "OPTIONS"
      + id                     = (known after apply)
      + passthrough_behavior   = (known after apply)
      + region                 = "ap-northeast-1"
      + request_templates      = {
          + "application/json" = jsonencode(
                {
                  + statusCode = 200
                }
            )
        }
      + resource_id            = (known after apply)
      + response_transfer_mode = (known after apply)
      + rest_api_id            = (known after apply)
      + timeout_milliseconds   = 29000
      + type                   = "MOCK"
    }

  # module.api.aws_api_gateway_integration.admin_categories_options will be created
  + resource "aws_api_gateway_integration" "admin_categories_options" {
      + cache_namespace        = (known after apply)
      + connection_type        = "INTERNET"
      + http_method            = "OPTIONS"
      + id                     = (known after apply)
      + passthrough_behavior   = (known after apply)
      + region                 = "ap-northeast-1"
      + request_templates      = {
          + "application/json" = jsonencode(
                {
                  + statusCode = 200
                }
            )
        }
      + resource_id            = (known after apply)
      + response_transfer_mode = (known after apply)
      + rest_api_id            = (known after apply)
      + timeout_milliseconds   = 29000
      + type                   = "MOCK"
    }

  # module.api.aws_api_gateway_integration.admin_categories_sort_options will be created
  + resource "aws_api_gateway_integration" "admin_categories_sort_options" {
      + cache_namespace        = (known after apply)
      + connection_type        = "INTERNET"
      + http_method            = "OPTIONS"
      + id                     = (known after apply)
      + passthrough_behavior   = (known after apply)
      + region                 = "ap-northeast-1"
      + request_templates      = {
          + "application/json" = jsonencode(
                {
                  + statusCode = 200
                }
            )
        }
      + resource_id            = (known after apply)
      + response_transfer_mode = (known after apply)
      + rest_api_id            = (known after apply)
      + timeout_milliseconds   = 29000
      + type                   = "MOCK"
    }

  # module.api.aws_api_gateway_integration.admin_images_key_options will be created
  + resource "aws_api_gateway_integration" "admin_images_key_options" {
      + cache_namespace        = (known after apply)
      + connection_type        = "INTERNET"
      + http_method            = "OPTIONS"
      + id                     = (known after apply)
      + passthrough_behavior   = (known after apply)
      + region                 = "ap-northeast-1"
      + request_templates      = {
          + "application/json" = jsonencode(
                {
                  + statusCode = 200
                }
            )
        }
      + resource_id            = (known after apply)
      + response_transfer_mode = (known after apply)
      + rest_api_id            = (known after apply)
      + timeout_milliseconds   = 29000
      + type                   = "MOCK"
    }

  # module.api.aws_api_gateway_integration.admin_images_upload_url_options will be created
  + resource "aws_api_gateway_integration" "admin_images_upload_url_options" {
      + cache_namespace        = (known after apply)
      + connection_type        = "INTERNET"
      + http_method            = "OPTIONS"
      + id                     = (known after apply)
      + passthrough_behavior   = (known after apply)
      + region                 = "ap-northeast-1"
      + request_templates      = {
          + "application/json" = jsonencode(
                {
                  + statusCode = 200
                }
            )
        }
      + resource_id            = (known after apply)
      + response_transfer_mode = (known after apply)
      + rest_api_id            = (known after apply)
      + timeout_milliseconds   = 29000
      + type                   = "MOCK"
    }

  # module.api.aws_api_gateway_integration.admin_mindmaps_id_options will be created
  + resource "aws_api_gateway_integration" "admin_mindmaps_id_options" {
      + cache_namespace        = (known after apply)
      + connection_type        = "INTERNET"
      + http_method            = "OPTIONS"
      + id                     = (known after apply)
      + passthrough_behavior   = (known after apply)
      + region                 = "ap-northeast-1"
      + request_templates      = {
          + "application/json" = jsonencode(
                {
                  + statusCode = 200
                }
            )
        }
      + resource_id            = (known after apply)
      + response_transfer_mode = (known after apply)
      + rest_api_id            = (known after apply)
      + timeout_milliseconds   = 29000
      + type                   = "MOCK"
    }

  # module.api.aws_api_gateway_integration.admin_mindmaps_options will be created
  + resource "aws_api_gateway_integration" "admin_mindmaps_options" {
      + cache_namespace        = (known after apply)
      + connection_type        = "INTERNET"
      + http_method            = "OPTIONS"
      + id                     = (known after apply)
      + passthrough_behavior   = (known after apply)
      + region                 = "ap-northeast-1"
      + request_templates      = {
          + "application/json" = jsonencode(
                {
                  + statusCode = 200
                }
            )
        }
      + resource_id            = (known after apply)
      + response_transfer_mode = (known after apply)
      + rest_api_id            = (known after apply)
      + timeout_milliseconds   = 29000
      + type                   = "MOCK"
    }

  # module.api.aws_api_gateway_integration.admin_posts_id_options will be created
  + resource "aws_api_gateway_integration" "admin_posts_id_options" {
      + cache_namespace        = (known after apply)
      + connection_type        = "INTERNET"
      + http_method            = "OPTIONS"
      + id                     = (known after apply)
      + passthrough_behavior   = (known after apply)
      + region                 = "ap-northeast-1"
      + request_templates      = {
          + "application/json" = jsonencode(
                {
                  + statusCode = 200
                }
            )
        }
      + resource_id            = (known after apply)
      + response_transfer_mode = (known after apply)
      + rest_api_id            = (known after apply)
      + timeout_milliseconds   = 29000
      + type                   = "MOCK"
    }

  # module.api.aws_api_gateway_integration.admin_posts_options will be created
  + resource "aws_api_gateway_integration" "admin_posts_options" {
      + cache_namespace        = (known after apply)
      + connection_type        = "INTERNET"
      + http_method            = "OPTIONS"
      + id                     = (known after apply)
      + passthrough_behavior   = (known after apply)
      + region                 = "ap-northeast-1"
      + request_templates      = {
          + "application/json" = jsonencode(
                {
                  + statusCode = 200
                }
            )
        }
      + resource_id            = (known after apply)
      + response_transfer_mode = (known after apply)
      + rest_api_id            = (known after apply)
      + timeout_milliseconds   = 29000
      + type                   = "MOCK"
    }

  # module.api.aws_api_gateway_integration.categories_options will be created
  + resource "aws_api_gateway_integration" "categories_options" {
      + cache_namespace        = (known after apply)
      + connection_type        = "INTERNET"
      + http_method            = "OPTIONS"
      + id                     = (known after apply)
      + passthrough_behavior   = (known after apply)
      + region                 = "ap-northeast-1"
      + request_templates      = {
          + "application/json" = jsonencode(
                {
                  + statusCode = 200
                }
            )
        }
      + resource_id            = (known after apply)
      + response_transfer_mode = (known after apply)
      + rest_api_id            = (known after apply)
      + timeout_milliseconds   = 29000
      + type                   = "MOCK"
    }

  # module.api.aws_api_gateway_integration.posts_id_options will be created
  + resource "aws_api_gateway_integration" "posts_id_options" {
      + cache_namespace        = (known after apply)
      + connection_type        = "INTERNET"
      + http_method            = "OPTIONS"
      + id                     = (known after apply)
      + passthrough_behavior   = (known after apply)
      + region                 = "ap-northeast-1"
      + request_templates      = {
          + "application/json" = jsonencode(
                {
                  + statusCode = 200
                }
            )
        }
      + resource_id            = (known after apply)
      + response_transfer_mode = (known after apply)
      + rest_api_id            = (known after apply)
      + timeout_milliseconds   = 29000
      + type                   = "MOCK"
    }

  # module.api.aws_api_gateway_integration.posts_options will be created
  + resource "aws_api_gateway_integration" "posts_options" {
      + cache_namespace        = (known after apply)
      + connection_type        = "INTERNET"
      + http_method            = "OPTIONS"
      + id                     = (known after apply)
      + passthrough_behavior   = (known after apply)
      + region                 = "ap-northeast-1"
      + request_templates      = {
          + "application/json" = jsonencode(
                {
                  + statusCode = 200
                }
            )
        }
      + resource_id            = (known after apply)
      + response_transfer_mode = (known after apply)
      + rest_api_id            = (known after apply)
      + timeout_milliseconds   = 29000
      + type                   = "MOCK"
    }

  # module.api.aws_api_gateway_integration.public_mindmaps_id_options will be created
  + resource "aws_api_gateway_integration" "public_mindmaps_id_options" {
      + cache_namespace        = (known after apply)
      + connection_type        = "INTERNET"
      + http_method            = "OPTIONS"
      + id                     = (known after apply)
      + passthrough_behavior   = (known after apply)
      + region                 = "ap-northeast-1"
      + request_templates      = {
          + "application/json" = jsonencode(
                {
                  + statusCode = 200
                }
            )
        }
      + resource_id            = (known after apply)
      + response_transfer_mode = (known after apply)
      + rest_api_id            = (known after apply)
      + timeout_milliseconds   = 29000
      + type                   = "MOCK"
    }

  # module.api.aws_api_gateway_integration.public_mindmaps_options will be created
  + resource "aws_api_gateway_integration" "public_mindmaps_options" {
      + cache_namespace        = (known after apply)
      + connection_type        = "INTERNET"
      + http_method            = "OPTIONS"
      + id                     = (known after apply)
      + passthrough_behavior   = (known after apply)
      + region                 = "ap-northeast-1"
      + request_templates      = {
          + "application/json" = jsonencode(
                {
                  + statusCode = 200
                }
            )
        }
      + resource_id            = (known after apply)
      + response_transfer_mode = (known after apply)
      + rest_api_id            = (known after apply)
      + timeout_milliseconds   = 29000
      + type                   = "MOCK"
    }

  # module.api.aws_api_gateway_integration_response.admin_auth_login_options will be created
  + resource "aws_api_gateway_integration_response" "admin_auth_login_options" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + region              = "ap-northeast-1"
      + resource_id         = (known after apply)
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = "'Content-Type,Authorization,X-Amz-Date,X-Api-Key,X-Amz-Security-Token'"
          + "method.response.header.Access-Control-Allow-Methods" = "'POST,OPTIONS'"
          + "method.response.header.Access-Control-Allow-Origin"  = "'https://boneofmyfallacy.net'"
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.api.aws_api_gateway_integration_response.admin_auth_logout_options will be created
  + resource "aws_api_gateway_integration_response" "admin_auth_logout_options" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + region              = "ap-northeast-1"
      + resource_id         = (known after apply)
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = "'Content-Type,Authorization,X-Amz-Date,X-Api-Key,X-Amz-Security-Token'"
          + "method.response.header.Access-Control-Allow-Methods" = "'POST,OPTIONS'"
          + "method.response.header.Access-Control-Allow-Origin"  = "'https://boneofmyfallacy.net'"
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.api.aws_api_gateway_integration_response.admin_auth_refresh_options will be created
  + resource "aws_api_gateway_integration_response" "admin_auth_refresh_options" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + region              = "ap-northeast-1"
      + resource_id         = (known after apply)
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = "'Content-Type,Authorization,X-Amz-Date,X-Api-Key,X-Amz-Security-Token'"
          + "method.response.header.Access-Control-Allow-Methods" = "'POST,OPTIONS'"
          + "method.response.header.Access-Control-Allow-Origin"  = "'https://boneofmyfallacy.net'"
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.api.aws_api_gateway_integration_response.admin_categories_id_options will be created
  + resource "aws_api_gateway_integration_response" "admin_categories_id_options" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + region              = "ap-northeast-1"
      + resource_id         = (known after apply)
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = "'Content-Type,Authorization,X-Amz-Date,X-Api-Key,X-Amz-Security-Token'"
          + "method.response.header.Access-Control-Allow-Methods" = "'PUT,DELETE,OPTIONS'"
          + "method.response.header.Access-Control-Allow-Origin"  = "'https://boneofmyfallacy.net'"
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.api.aws_api_gateway_integration_response.admin_categories_options will be created
  + resource "aws_api_gateway_integration_response" "admin_categories_options" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + region              = "ap-northeast-1"
      + resource_id         = (known after apply)
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = "'Content-Type,Authorization,X-Amz-Date,X-Api-Key,X-Amz-Security-Token'"
          + "method.response.header.Access-Control-Allow-Methods" = "'POST,OPTIONS'"
          + "method.response.header.Access-Control-Allow-Origin"  = "'https://boneofmyfallacy.net'"
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.api.aws_api_gateway_integration_response.admin_categories_sort_options will be created
  + resource "aws_api_gateway_integration_response" "admin_categories_sort_options" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + region              = "ap-northeast-1"
      + resource_id         = (known after apply)
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = "'Content-Type,Authorization,X-Amz-Date,X-Api-Key,X-Amz-Security-Token'"
          + "method.response.header.Access-Control-Allow-Methods" = "'PATCH,OPTIONS'"
          + "method.response.header.Access-Control-Allow-Origin"  = "'https://boneofmyfallacy.net'"
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.api.aws_api_gateway_integration_response.admin_images_key_options will be created
  + resource "aws_api_gateway_integration_response" "admin_images_key_options" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + region              = "ap-northeast-1"
      + resource_id         = (known after apply)
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = "'Content-Type,Authorization,X-Amz-Date,X-Api-Key,X-Amz-Security-Token'"
          + "method.response.header.Access-Control-Allow-Methods" = "'DELETE,OPTIONS'"
          + "method.response.header.Access-Control-Allow-Origin"  = "'https://boneofmyfallacy.net'"
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.api.aws_api_gateway_integration_response.admin_images_upload_url_options will be created
  + resource "aws_api_gateway_integration_response" "admin_images_upload_url_options" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + region              = "ap-northeast-1"
      + resource_id         = (known after apply)
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = "'Content-Type,Authorization,X-Amz-Date,X-Api-Key,X-Amz-Security-Token'"
          + "method.response.header.Access-Control-Allow-Methods" = "'POST,OPTIONS'"
          + "method.response.header.Access-Control-Allow-Origin"  = "'https://boneofmyfallacy.net'"
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.api.aws_api_gateway_integration_response.admin_mindmaps_id_options will be created
  + resource "aws_api_gateway_integration_response" "admin_mindmaps_id_options" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + region              = "ap-northeast-1"
      + resource_id         = (known after apply)
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = "'Content-Type,Authorization,X-Amz-Date,X-Api-Key,X-Amz-Security-Token'"
          + "method.response.header.Access-Control-Allow-Methods" = "'GET,PUT,DELETE,OPTIONS'"
          + "method.response.header.Access-Control-Allow-Origin"  = "'https://boneofmyfallacy.net'"
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.api.aws_api_gateway_integration_response.admin_mindmaps_options will be created
  + resource "aws_api_gateway_integration_response" "admin_mindmaps_options" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + region              = "ap-northeast-1"
      + resource_id         = (known after apply)
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = "'Content-Type,Authorization,X-Amz-Date,X-Api-Key,X-Amz-Security-Token'"
          + "method.response.header.Access-Control-Allow-Methods" = "'GET,POST,OPTIONS'"
          + "method.response.header.Access-Control-Allow-Origin"  = "'https://boneofmyfallacy.net'"
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.api.aws_api_gateway_integration_response.admin_posts_id_options will be created
  + resource "aws_api_gateway_integration_response" "admin_posts_id_options" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + region              = "ap-northeast-1"
      + resource_id         = (known after apply)
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = "'Content-Type,Authorization,X-Amz-Date,X-Api-Key,X-Amz-Security-Token'"
          + "method.response.header.Access-Control-Allow-Methods" = "'GET,PUT,DELETE,OPTIONS'"
          + "method.response.header.Access-Control-Allow-Origin"  = "'https://boneofmyfallacy.net'"
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.api.aws_api_gateway_integration_response.admin_posts_options will be created
  + resource "aws_api_gateway_integration_response" "admin_posts_options" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + region              = "ap-northeast-1"
      + resource_id         = (known after apply)
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = "'Content-Type,Authorization,X-Amz-Date,X-Api-Key,X-Amz-Security-Token'"
          + "method.response.header.Access-Control-Allow-Methods" = "'GET,POST,OPTIONS'"
          + "method.response.header.Access-Control-Allow-Origin"  = "'https://boneofmyfallacy.net'"
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.api.aws_api_gateway_integration_response.categories_options will be created
  + resource "aws_api_gateway_integration_response" "categories_options" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + region              = "ap-northeast-1"
      + resource_id         = (known after apply)
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = "'Content-Type,Authorization,X-Amz-Date,X-Api-Key,X-Amz-Security-Token'"
          + "method.response.header.Access-Control-Allow-Methods" = "'GET,OPTIONS'"
          + "method.response.header.Access-Control-Allow-Origin"  = "'https://boneofmyfallacy.net'"
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.api.aws_api_gateway_integration_response.posts_id_options will be created
  + resource "aws_api_gateway_integration_response" "posts_id_options" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + region              = "ap-northeast-1"
      + resource_id         = (known after apply)
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = "'Content-Type,Authorization,X-Amz-Date,X-Api-Key,X-Amz-Security-Token'"
          + "method.response.header.Access-Control-Allow-Methods" = "'GET,OPTIONS'"
          + "method.response.header.Access-Control-Allow-Origin"  = "'https://boneofmyfallacy.net'"
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.api.aws_api_gateway_integration_response.posts_options will be created
  + resource "aws_api_gateway_integration_response" "posts_options" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + region              = "ap-northeast-1"
      + resource_id         = (known after apply)
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = "'Content-Type,Authorization,X-Amz-Date,X-Api-Key,X-Amz-Security-Token'"
          + "method.response.header.Access-Control-Allow-Methods" = "'GET,OPTIONS'"
          + "method.response.header.Access-Control-Allow-Origin"  = "'https://boneofmyfallacy.net'"
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.api.aws_api_gateway_integration_response.public_mindmaps_id_options will be created
  + resource "aws_api_gateway_integration_response" "public_mindmaps_id_options" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + region              = "ap-northeast-1"
      + resource_id         = (known after apply)
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = "'Content-Type,Authorization,X-Amz-Date,X-Api-Key,X-Amz-Security-Token'"
          + "method.response.header.Access-Control-Allow-Methods" = "'GET,OPTIONS'"
          + "method.response.header.Access-Control-Allow-Origin"  = "'https://boneofmyfallacy.net'"
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.api.aws_api_gateway_integration_response.public_mindmaps_options will be created
  + resource "aws_api_gateway_integration_response" "public_mindmaps_options" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + region              = "ap-northeast-1"
      + resource_id         = (known after apply)
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = "'Content-Type,Authorization,X-Amz-Date,X-Api-Key,X-Amz-Security-Token'"
          + "method.response.header.Access-Control-Allow-Methods" = "'GET,OPTIONS'"
          + "method.response.header.Access-Control-Allow-Origin"  = "'https://boneofmyfallacy.net'"
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.api.aws_api_gateway_method.admin_auth_login_options will be created
  + resource "aws_api_gateway_method" "admin_auth_login_options" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "OPTIONS"
      + id               = (known after apply)
      + region           = "ap-northeast-1"
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.api.aws_api_gateway_method.admin_auth_login_post will be created
  + resource "aws_api_gateway_method" "admin_auth_login_post" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "POST"
      + id               = (known after apply)
      + region           = "ap-northeast-1"
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.api.aws_api_gateway_method.admin_auth_logout_options will be created
  + resource "aws_api_gateway_method" "admin_auth_logout_options" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "OPTIONS"
      + id               = (known after apply)
      + region           = "ap-northeast-1"
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.api.aws_api_gateway_method.admin_auth_logout_post will be created
  + resource "aws_api_gateway_method" "admin_auth_logout_post" {
      + api_key_required = false
      + authorization    = "COGNITO_USER_POOLS"
      + authorizer_id    = (known after apply)
      + http_method      = "POST"
      + id               = (known after apply)
      + region           = "ap-northeast-1"
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.api.aws_api_gateway_method.admin_auth_refresh_options will be created
  + resource "aws_api_gateway_method" "admin_auth_refresh_options" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "OPTIONS"
      + id               = (known after apply)
      + region           = "ap-northeast-1"
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.api.aws_api_gateway_method.admin_auth_refresh_post will be created
  + resource "aws_api_gateway_method" "admin_auth_refresh_post" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "POST"
      + id               = (known after apply)
      + region           = "ap-northeast-1"
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.api.aws_api_gateway_method.admin_categories_id_delete will be created
  + resource "aws_api_gateway_method" "admin_categories_id_delete" {
      + api_key_required   = false
      + authorization      = "COGNITO_USER_POOLS"
      + authorizer_id      = (known after apply)
      + http_method        = "DELETE"
      + id                 = (known after apply)
      + region             = "ap-northeast-1"
      + request_parameters = {
          + "method.request.path.id" = true
        }
      + resource_id        = (known after apply)
      + rest_api_id        = (known after apply)
    }

  # module.api.aws_api_gateway_method.admin_categories_id_options will be created
  + resource "aws_api_gateway_method" "admin_categories_id_options" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "OPTIONS"
      + id               = (known after apply)
      + region           = "ap-northeast-1"
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.api.aws_api_gateway_method.admin_categories_id_put will be created
  + resource "aws_api_gateway_method" "admin_categories_id_put" {
      + api_key_required   = false
      + authorization      = "COGNITO_USER_POOLS"
      + authorizer_id      = (known after apply)
      + http_method        = "PUT"
      + id                 = (known after apply)
      + region             = "ap-northeast-1"
      + request_parameters = {
          + "method.request.path.id" = true
        }
      + resource_id        = (known after apply)
      + rest_api_id        = (known after apply)
    }

  # module.api.aws_api_gateway_method.admin_categories_options will be created
  + resource "aws_api_gateway_method" "admin_categories_options" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "OPTIONS"
      + id               = (known after apply)
      + region           = "ap-northeast-1"
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.api.aws_api_gateway_method.admin_categories_post will be created
  + resource "aws_api_gateway_method" "admin_categories_post" {
      + api_key_required = false
      + authorization    = "COGNITO_USER_POOLS"
      + authorizer_id    = (known after apply)
      + http_method      = "POST"
      + id               = (known after apply)
      + region           = "ap-northeast-1"
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.api.aws_api_gateway_method.admin_categories_sort_options will be created
  + resource "aws_api_gateway_method" "admin_categories_sort_options" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "OPTIONS"
      + id               = (known after apply)
      + region           = "ap-northeast-1"
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.api.aws_api_gateway_method.admin_categories_sort_patch will be created
  + resource "aws_api_gateway_method" "admin_categories_sort_patch" {
      + api_key_required = false
      + authorization    = "COGNITO_USER_POOLS"
      + authorizer_id    = (known after apply)
      + http_method      = "PATCH"
      + id               = (known after apply)
      + region           = "ap-northeast-1"
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.api.aws_api_gateway_method.admin_images_key_delete will be created
  + resource "aws_api_gateway_method" "admin_images_key_delete" {
      + api_key_required   = false
      + authorization      = "COGNITO_USER_POOLS"
      + authorizer_id      = (known after apply)
      + http_method        = "DELETE"
      + id                 = (known after apply)
      + region             = "ap-northeast-1"
      + request_parameters = {
          + "method.request.path.key" = true
        }
      + resource_id        = (known after apply)
      + rest_api_id        = (known after apply)
    }

  # module.api.aws_api_gateway_method.admin_images_key_options will be created
  + resource "aws_api_gateway_method" "admin_images_key_options" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "OPTIONS"
      + id               = (known after apply)
      + region           = "ap-northeast-1"
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.api.aws_api_gateway_method.admin_images_upload_url_options will be created
  + resource "aws_api_gateway_method" "admin_images_upload_url_options" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "OPTIONS"
      + id               = (known after apply)
      + region           = "ap-northeast-1"
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.api.aws_api_gateway_method.admin_images_upload_url_post will be created
  + resource "aws_api_gateway_method" "admin_images_upload_url_post" {
      + api_key_required = false
      + authorization    = "COGNITO_USER_POOLS"
      + authorizer_id    = (known after apply)
      + http_method      = "POST"
      + id               = (known after apply)
      + region           = "ap-northeast-1"
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.api.aws_api_gateway_method.admin_mindmaps_get will be created
  + resource "aws_api_gateway_method" "admin_mindmaps_get" {
      + api_key_required = false
      + authorization    = "COGNITO_USER_POOLS"
      + authorizer_id    = (known after apply)
      + http_method      = "GET"
      + id               = (known after apply)
      + region           = "ap-northeast-1"
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.api.aws_api_gateway_method.admin_mindmaps_id_delete will be created
  + resource "aws_api_gateway_method" "admin_mindmaps_id_delete" {
      + api_key_required   = false
      + authorization      = "COGNITO_USER_POOLS"
      + authorizer_id      = (known after apply)
      + http_method        = "DELETE"
      + id                 = (known after apply)
      + region             = "ap-northeast-1"
      + request_parameters = {
          + "method.request.path.id" = true
        }
      + resource_id        = (known after apply)
      + rest_api_id        = (known after apply)
    }

  # module.api.aws_api_gateway_method.admin_mindmaps_id_get will be created
  + resource "aws_api_gateway_method" "admin_mindmaps_id_get" {
      + api_key_required   = false
      + authorization      = "COGNITO_USER_POOLS"
      + authorizer_id      = (known after apply)
      + http_method        = "GET"
      + id                 = (known after apply)
      + region             = "ap-northeast-1"
      + request_parameters = {
          + "method.request.path.id" = true
        }
      + resource_id        = (known after apply)
      + rest_api_id        = (known after apply)
    }

  # module.api.aws_api_gateway_method.admin_mindmaps_id_options will be created
  + resource "aws_api_gateway_method" "admin_mindmaps_id_options" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "OPTIONS"
      + id               = (known after apply)
      + region           = "ap-northeast-1"
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.api.aws_api_gateway_method.admin_mindmaps_id_put will be created
  + resource "aws_api_gateway_method" "admin_mindmaps_id_put" {
      + api_key_required   = false
      + authorization      = "COGNITO_USER_POOLS"
      + authorizer_id      = (known after apply)
      + http_method        = "PUT"
      + id                 = (known after apply)
      + region             = "ap-northeast-1"
      + request_parameters = {
          + "method.request.path.id" = true
        }
      + resource_id        = (known after apply)
      + rest_api_id        = (known after apply)
    }

  # module.api.aws_api_gateway_method.admin_mindmaps_options will be created
  + resource "aws_api_gateway_method" "admin_mindmaps_options" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "OPTIONS"
      + id               = (known after apply)
      + region           = "ap-northeast-1"
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.api.aws_api_gateway_method.admin_mindmaps_post will be created
  + resource "aws_api_gateway_method" "admin_mindmaps_post" {
      + api_key_required = false
      + authorization    = "COGNITO_USER_POOLS"
      + authorizer_id    = (known after apply)
      + http_method      = "POST"
      + id               = (known after apply)
      + region           = "ap-northeast-1"
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.api.aws_api_gateway_method.admin_posts_get will be created
  + resource "aws_api_gateway_method" "admin_posts_get" {
      + api_key_required = false
      + authorization    = "COGNITO_USER_POOLS"
      + authorizer_id    = (known after apply)
      + http_method      = "GET"
      + id               = (known after apply)
      + region           = "ap-northeast-1"
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.api.aws_api_gateway_method.admin_posts_id_delete will be created
  + resource "aws_api_gateway_method" "admin_posts_id_delete" {
      + api_key_required   = false
      + authorization      = "COGNITO_USER_POOLS"
      + authorizer_id      = (known after apply)
      + http_method        = "DELETE"
      + id                 = (known after apply)
      + region             = "ap-northeast-1"
      + request_parameters = {
          + "method.request.path.id" = true
        }
      + resource_id        = (known after apply)
      + rest_api_id        = (known after apply)
    }

  # module.api.aws_api_gateway_method.admin_posts_id_get will be created
  + resource "aws_api_gateway_method" "admin_posts_id_get" {
      + api_key_required   = false
      + authorization      = "COGNITO_USER_POOLS"
      + authorizer_id      = (known after apply)
      + http_method        = "GET"
      + id                 = (known after apply)
      + region             = "ap-northeast-1"
      + request_parameters = {
          + "method.request.path.id" = true
        }
      + resource_id        = (known after apply)
      + rest_api_id        = (known after apply)
    }

  # module.api.aws_api_gateway_method.admin_posts_id_options will be created
  + resource "aws_api_gateway_method" "admin_posts_id_options" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "OPTIONS"
      + id               = (known after apply)
      + region           = "ap-northeast-1"
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.api.aws_api_gateway_method.admin_posts_id_put will be created
  + resource "aws_api_gateway_method" "admin_posts_id_put" {
      + api_key_required   = false
      + authorization      = "COGNITO_USER_POOLS"
      + authorizer_id      = (known after apply)
      + http_method        = "PUT"
      + id                 = (known after apply)
      + region             = "ap-northeast-1"
      + request_parameters = {
          + "method.request.path.id" = true
        }
      + resource_id        = (known after apply)
      + rest_api_id        = (known after apply)
    }

  # module.api.aws_api_gateway_method.admin_posts_options will be created
  + resource "aws_api_gateway_method" "admin_posts_options" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "OPTIONS"
      + id               = (known after apply)
      + region           = "ap-northeast-1"
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.api.aws_api_gateway_method.admin_posts_post will be created
  + resource "aws_api_gateway_method" "admin_posts_post" {
      + api_key_required = false
      + authorization    = "COGNITO_USER_POOLS"
      + authorizer_id    = (known after apply)
      + http_method      = "POST"
      + id               = (known after apply)
      + region           = "ap-northeast-1"
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.api.aws_api_gateway_method.categories_get will be created
  + resource "aws_api_gateway_method" "categories_get" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "GET"
      + id               = (known after apply)
      + region           = "ap-northeast-1"
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.api.aws_api_gateway_method.categories_options will be created
  + resource "aws_api_gateway_method" "categories_options" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "OPTIONS"
      + id               = (known after apply)
      + region           = "ap-northeast-1"
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.api.aws_api_gateway_method.posts_get will be created
  + resource "aws_api_gateway_method" "posts_get" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "GET"
      + id               = (known after apply)
      + region           = "ap-northeast-1"
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.api.aws_api_gateway_method.posts_id_get will be created
  + resource "aws_api_gateway_method" "posts_id_get" {
      + api_key_required   = false
      + authorization      = "NONE"
      + http_method        = "GET"
      + id                 = (known after apply)
      + region             = "ap-northeast-1"
      + request_parameters = {
          + "method.request.path.id" = true
        }
      + resource_id        = (known after apply)
      + rest_api_id        = (known after apply)
    }

  # module.api.aws_api_gateway_method.posts_id_options will be created
  + resource "aws_api_gateway_method" "posts_id_options" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "OPTIONS"
      + id               = (known after apply)
      + region           = "ap-northeast-1"
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.api.aws_api_gateway_method.posts_options will be created
  + resource "aws_api_gateway_method" "posts_options" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "OPTIONS"
      + id               = (known after apply)
      + region           = "ap-northeast-1"
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.api.aws_api_gateway_method.public_mindmaps_get will be created
  + resource "aws_api_gateway_method" "public_mindmaps_get" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "GET"
      + id               = (known after apply)
      + region           = "ap-northeast-1"
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.api.aws_api_gateway_method.public_mindmaps_id_get will be created
  + resource "aws_api_gateway_method" "public_mindmaps_id_get" {
      + api_key_required   = false
      + authorization      = "NONE"
      + http_method        = "GET"
      + id                 = (known after apply)
      + region             = "ap-northeast-1"
      + request_parameters = {
          + "method.request.path.id" = true
        }
      + resource_id        = (known after apply)
      + rest_api_id        = (known after apply)
    }

  # module.api.aws_api_gateway_method.public_mindmaps_id_options will be created
  + resource "aws_api_gateway_method" "public_mindmaps_id_options" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "OPTIONS"
      + id               = (known after apply)
      + region           = "ap-northeast-1"
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.api.aws_api_gateway_method.public_mindmaps_options will be created
  + resource "aws_api_gateway_method" "public_mindmaps_options" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "OPTIONS"
      + id               = (known after apply)
      + region           = "ap-northeast-1"
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.api.aws_api_gateway_method_response.admin_auth_login_options will be created
  + resource "aws_api_gateway_method_response" "admin_auth_login_options" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + region              = "ap-northeast-1"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = true
          + "method.response.header.Access-Control-Allow-Methods" = true
          + "method.response.header.Access-Control-Allow-Origin"  = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.api.aws_api_gateway_method_response.admin_auth_logout_options will be created
  + resource "aws_api_gateway_method_response" "admin_auth_logout_options" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + region              = "ap-northeast-1"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = true
          + "method.response.header.Access-Control-Allow-Methods" = true
          + "method.response.header.Access-Control-Allow-Origin"  = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.api.aws_api_gateway_method_response.admin_auth_refresh_options will be created
  + resource "aws_api_gateway_method_response" "admin_auth_refresh_options" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + region              = "ap-northeast-1"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = true
          + "method.response.header.Access-Control-Allow-Methods" = true
          + "method.response.header.Access-Control-Allow-Origin"  = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.api.aws_api_gateway_method_response.admin_categories_id_options will be created
  + resource "aws_api_gateway_method_response" "admin_categories_id_options" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + region              = "ap-northeast-1"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = true
          + "method.response.header.Access-Control-Allow-Methods" = true
          + "method.response.header.Access-Control-Allow-Origin"  = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.api.aws_api_gateway_method_response.admin_categories_options will be created
  + resource "aws_api_gateway_method_response" "admin_categories_options" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + region              = "ap-northeast-1"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = true
          + "method.response.header.Access-Control-Allow-Methods" = true
          + "method.response.header.Access-Control-Allow-Origin"  = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.api.aws_api_gateway_method_response.admin_categories_sort_options will be created
  + resource "aws_api_gateway_method_response" "admin_categories_sort_options" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + region              = "ap-northeast-1"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = true
          + "method.response.header.Access-Control-Allow-Methods" = true
          + "method.response.header.Access-Control-Allow-Origin"  = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.api.aws_api_gateway_method_response.admin_images_key_options will be created
  + resource "aws_api_gateway_method_response" "admin_images_key_options" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + region              = "ap-northeast-1"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = true
          + "method.response.header.Access-Control-Allow-Methods" = true
          + "method.response.header.Access-Control-Allow-Origin"  = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.api.aws_api_gateway_method_response.admin_images_upload_url_options will be created
  + resource "aws_api_gateway_method_response" "admin_images_upload_url_options" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + region              = "ap-northeast-1"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = true
          + "method.response.header.Access-Control-Allow-Methods" = true
  

... (truncated)
```

</details>